
&НаСервере
Процедура Затр_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Затр_УправлениеСвойствамиВызовСервера.ПлатежноеПоручениеПриСозданииНаСервере(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура Затр_Подключаемый_ПриИзмененииДополнительногоСведения(Элемент)
	
	Затр_УправлениеСвойствамиВызовСервера.Затр_ЗаписатьСведенияНаСервере(Объект.Ссылка, Элемент.Имя, ЭтаФорма[Элемент.Имя]);
		  
КонецПроцедуры

&НаКлиенте
Процедура Затр_КонтрагентПриИзмененииПосле(Элемент)
	
	Затр_КонтрагентПриИзмененииНаСервере(Объект.Контрагент);
	
КонецПроцедуры

&НаКлиенте
Процедура Затр_НалогоплательщикПриИзмененииПосле(Элемент)
	
	Затр_КонтрагентПриИзмененииНаСервере(Объект.Налогоплательщик);
	
КонецПроцедуры

&НаКлиенте
Процедура Затр_БанкПриИзмененииПосле(Элемент)
	
	Затр_КонтрагентПриИзмененииНаСервере(Объект.Банк);
	
КонецПроцедуры

&НаСервере
Процедура Затр_КонтрагентПриИзмененииНаСервере(Затр_Контрагент)
	
	Затр_УправлениеСвойствамиВызовСервера.ПлатежноеПоручениеКонтрагентПриИзменении(Затр_Контрагент, Объект, ЭтаФорма);
	
КонецПроцедуры	