Процедура Затр_ЗаписатьСведенияНаСервере(Ссылка, ИмяСвойства, Значение) Экспорт
	
	ТаблицаСвойствИЗначений = Новый ТаблицаЗначений;
	ТаблицаСвойствИЗначений.Колонки.Добавить("Свойство");
	ТаблицаСвойствИЗначений.Колонки.Добавить("Значение");
	
	НоваяСтрока = ТаблицаСвойствИЗначений.Добавить();
	Свойства = УправлениеСвойствами.СвойстваОбъекта(Ссылка, Ложь, Истина);
	Для Каждого Свойство Из Свойства Цикл
		Если Свойство.Имя = ИмяСвойства Тогда
			НоваяСтрока.Свойство = Свойство;	
		КонецЕсли;	
	КонецЦикла;	
	НоваяСтрока.Значение = Значение;
	
	УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(Ссылка, ТаблицаСвойствИЗначений); 
	
КонецПроцедуры	